backend/controllers/AuthController.php

SELECT COUNT(*) FROM `admin` WHERE 1
SELECT * FROM `admin` WHERE 1 LIMIT 10
---
    public function actionUser(){

        $query = Admin::find()->andWhere(1);

        $pages = new Pagination(['totalCount' =>$query->count(), 'pageSize' => 10]);
        $users = $query->offset($pages->offset)->limit($pages->limit)->all();

SELECT * FROM `auth_item` WHERE `name`='user'
---
    public function actionParentChild(){
        $auth = Yii::$app->authManager;
        $mAuthItem = new AuthItem();
        if( Yii::$app->getRequest()->getIsPost() ){
            $name = trim(Yii::$app->getRequest()->post('name'));
            $children = Yii::$app->getRequest()->post('children');


            $row = $mAuthItem::findOne($name);